ErpTest/src/Catalogs/уатТарифыЗП/уатТарифыЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатТарифыЗП</name>
  <comment>Тарифы зарплаты сотрудников (уат)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СпособРасчетаОплатыТруда</name>
    <type>
      <types>EnumRef.уатСпособыРасчетаОплатыТруда</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкаТарифа1</name>
    <comment>Группировка тарифа 1</comment>
    <type>
      <types>EnumRef.уатГруппировкиТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкаТарифа2</name>
    <comment>Группировка тарифа 2</comment>
    <type>
      <types>EnumRef.уатГруппировкиТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппировкаТарифа3</name>
    <comment>Группировка тарифа 3</comment>
    <type>
      <types>EnumRef.уатГруппировкиТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисления</name>
    <comment>Вид начисления</comment>
    <type>
      <types>ChartOfCalculationTypesRef.Начисления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СложныйТариф</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПоСтрокам</name>
    <comment>Расчет начислений отдельно по строкам Задания путевого листа, либо по итогам </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаРасчета</name>
    <attributes>
      <name>ЗнакГруппировки1</name>
      <comment>Знак группировки 1</comment>
      <type>
        <types>EnumRef.уатЗнакиСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗнакГруппировки2</name>
      <comment>Знак группировки 2</comment>
      <type>
        <types>EnumRef.уатЗнакиСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗнакГруппировки3</name>
      <comment>Знак группировки 3</comment>
      <type>
        <types>EnumRef.уатЗнакиСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеГруппировки1</name>
      <comment>Значение группировки 1</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеГруппировки2</name>
      <comment>Значение группировки 2</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеГруппировки3</name>
      <comment>Значение группировки 3</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <comment>Тариф</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбластиДействия</name>
    <attributes>
      <name>ВидОбластиДействия</name>
      <type>
        <types>EnumRef.уатВидыОбластейДействияТарифовТС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеОбластиДействия</name>
      <type>
        <types>DefinedType.уатВидыОбластейДействияТарифа</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОбластьДействия</name>
      <type>
        <types>CatalogRef.уатМаршруты</types>
        <types>CatalogRef.уатВидыОбслуживанияТС</types>
        <types>CatalogRef.ТранспортныеСредства</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.уатМоделиТС</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
        <types>CatalogRef.СМ_ОбъектыСтроительства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <comment>Организация</comment>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/Enums/уатСпособыРасчетаОплатыТруда/уатСпособыРасчетаОплатыТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатСпособыРасчетаОплатыТруда</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>СдельныйЗаработок</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентомОтВыручки</name>
  </enumValues>
  <enumValues>
    <name>ПроцентомОтВидовНачислений</name>
  </enumValues>
  <enumValues>
    <name>ФиксированнойСуммой</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаНочныеЧасы</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/уатСпособРасчетаПараметровВыработки/уатСпособРасчетаПараметровВыработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатСпособРасчетаПараметровВыработки</name>
  <enumValues>
    <name>НеРассчитывать</name>
  </enumValues>
  <enumValues>
    <name>ПоШапке</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаданию</name>
  </enumValues>
  <enumValues>
    <name>ПоТТД</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/уатГруппировкиТарифов/уатГруппировкиТарифов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатГруппировкиТарифов</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Расстояние</name>
  </enumValues>
  <enumValues>
    <name>ВремяРаботы</name>
  </enumValues>
  <enumValues>
    <name>Грузоподъемность</name>
  </enumValues>
  <enumValues>
    <name>КлассГруза</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/уатВидыОбластейДействияТарифовТС/уатВидыОбластейДействияТарифовТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыОбластейДействияТарифовТС</name>
  <enumValues>
    <name>ВидПеревозки</name>
  </enumValues>
  <enumValues>
    <name>ДоговорКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>Контрагент</name>
  </enumValues>
  <enumValues>
    <name>Маршрут</name>
  </enumValues>
  <enumValues>
    <name>МодельПрицепа</name>
  </enumValues>
  <enumValues>
    <name>МодельТягача</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>ОбъектСтроительства</name>
  </enumValues>
  <enumValues>
    <name>Прицеп</name>
  </enumValues>
  <enumValues>
    <name>ПунктНазначения</name>
  </enumValues>
  <enumValues>
    <name>ПунктОтправления</name>
  </enumValues>
  <enumValues>
    <name>ТипПрицепа</name>
  </enumValues>
  <enumValues>
    <name>ТипТягача</name>
  </enumValues>
  <enumValues>
    <name>Тягач</name>
  </enumValues>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Catalogs/уатПараметрыВыработки/уатПараметрыВыработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПараметрыВыработки</name>
  <comment>(уат)</comment>
  <predefined>
    <items>
      <name>ВесГруза</name>
      <description>Вес груза</description>
    </items>
    <items>
      <name>ВремяВНаряде</name>
      <description>Время в наряде</description>
    </items>
    <items>
      <name>ВремяВПростое</name>
      <description>Время в простое</description>
    </items>
    <items>
      <name>ВремяВПростоеСВклДвигателем</name>
      <description>Время в простое с вкл двигателем</description>
    </items>
    <items>
      <name>ВремяВРаботе</name>
      <description>Время в работе</description>
    </items>
    <items>
      <name>ВремяВРаботеПоДаннымGPS</name>
      <description>Время в работе по данным GPS</description>
    </items>
    <items>
      <name>ВремяВРемонте</name>
      <description>Время в ремонте</description>
    </items>
    <items>
      <name>ВремяДневное</name>
      <description>Время дневное</description>
    </items>
    <items>
      <name>ВремяНочное</name>
      <description>Время ночное</description>
    </items>
    <items>
      <name>ВремяПраздничное</name>
      <description>Время праздничное</description>
    </items>
    <items>
      <name>ВремяСпециальнойРаботы</name>
      <description>Время специальной работы</description>
    </items>
    <items>
      <name>КоличествоДней</name>
      <description>Количество дней</description>
    </items>
    <items>
      <name>КоличествоЕздок</name>
      <description>Количество ездок</description>
    </items>
    <items>
      <name>КоличествоОпераций</name>
      <description>Количество операций</description>
    </items>
    <items>
      <name>КоличествоПассажиров</name>
      <description>Количество пассажиров</description>
    </items>
    <items>
      <name>КоличествоРейсов</name>
      <description>Количество рейсов</description>
    </items>
    <items>
      <name>КоличествоТС</name>
      <description>Количество ТС</description>
    </items>
    <items>
      <name>ОбъемКм</name>
      <description>м3 км</description>
    </items>
    <items>
      <name>Объем</name>
      <description>Объем груза</description>
    </items>
    <items>
      <name>ПогрузочноРазгрузочныеРаботы</name>
      <description>Погрузочно разгрузочные работы</description>
    </items>
    <items>
      <name>Подача</name>
      <description>Подача</description>
    </items>
    <items>
      <name>ПробегНаБуксире</name>
      <description>Пробег на буксире</description>
    </items>
    <items>
      <name>ПробегОбщий</name>
      <description>Пробег общий</description>
    </items>
    <items>
      <name>ПробегОбщийПоДаннымGPS</name>
      <description>Пробег общий по данным GPS</description>
    </items>
    <items>
      <name>ПробегПорожний</name>
      <description>Пробег порожний</description>
    </items>
    <items>
      <name>ПробегСГрузом</name>
      <description>Пробег с грузом</description>
    </items>
    <items>
      <name>ПробегСПассажирами</name>
      <description>Пробег с пассажирами</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы</name>
      <description>Пробег специальной работы</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы2</name>
      <description>Пробег специальной работы 2</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы3</name>
      <description>Пробег специальной работы 3</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы4</name>
      <description>Пробег специальной работы 4</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы5</name>
      <description>Пробег специальной работы 5</description>
    </items>
    <items>
      <name>ПростойПодПогрузкой</name>
      <description>Простой под погрузкой</description>
    </items>
    <items>
      <name>ПростойПодРазгрузкой</name>
      <description>Простой под разгрузкой</description>
    </items>
    <items>
      <name>ТнКм</name>
      <description>Тн км</description>
    </items>
  </predefined>
  <attributes>
    <name>АлгоритмРасчетаПараметра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаТС</name>
    <comment>Действует на ТС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаСотрудников</name>
    <comment>Действует на сотрудников</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВТарифахНаУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Временный</name>
    <comment>Признак того, что параметр временной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПараметровВыработки</name>
    <type>
      <types>EnumRef.уатСпособРасчетаПараметровВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательНаработки</name>
    <type>
      <types>CatalogRef.ПоказателиНаработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПоНомеруЭтапа</name>
    <comment>0 - суммировать значения, 1 - выбирать максимальное значение</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/Catalogs/уатТарифыЗП/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	об = РеквизитФормыВЗначение("Объект");
	//уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Об, Отказ, СтандартнаяОбработка, ЭтаФорма, ДопПараметрыОткрытие);
	ЗначениеВРеквизитФормы(Об,"Объект");
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	ОснОрганизацияПользователя = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.ТекущийПользователь(), "ОсновнаяОрганизация");
	
	ЗаполнитьПредставлениеТС();
	
	// УправлениеПредприятием.СлужебныеПодсистемы
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// Конец УправлениеПредприятием.СлужебныеПодсистемы
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьПредставлениеТС();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьПредставлениеТС();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СпособРасчетаОплатыТрудаПриИзменении(Неопределено);
	
	Модифицированность = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СпособРасчетаОплатыТрудаПриИзменении(Элемент)
	Если Объект.СпособРасчетаОплатыТруда <> ПредопределенноеЗначение(
			"Перечисление.уатСпособыРасчетаОплатыТруда.СдельныйЗаработок") Тогда
		Если Объект.РасчетПоСтрокам Тогда
			Объект.РасчетПоСтрокам = Ложь;
		КонецЕсли;
		Если Объект.СложныйТариф Тогда
			Объект.СложныйТариф = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьСписокТиповОбласти();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрВыработкиПриИзменении(Элемент)
	Если (НЕ ПараметрВыработкиПрименимДляПострочногоРасчета()) И Объект.РасчетПоСтрокам Тогда
		Объект.РасчетПоСтрокам = Ложь;
	КонецЕсли;
	
	УстановитьСписокТиповОбласти();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрВыработкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("ДействуетНаСотрудников", Истина);
	ПараметрыФормы.Вставить("Отбор", Отбор);
		
	ОткрытьФорму("Справочник.уатПараметрыВыработки.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СложныйТарифПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура РасчетПоСтрокамПриИзменении(Элемент)
	УстановитьСписокТиповОбласти();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаТарифа1ПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаТарифа2ПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаТарифа3ПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВидНачисленияПриИзменении(Элемент)
	УстановитьСписокТиповОбласти();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбластиДействияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.ОбластиДействия.ТекущиеДанные;
	УстановитьТипОбласти(ТекСтрока.ВидОбластиДействия);
КонецПроцедуры

&НаКлиенте
Процедура ОбластиДействияВидОбластиДействияПриИзменении(Элемент)
	ТекСтрока = Элементы.ОбластиДействия.ТекущиеДанные;
	ТекСтрока.ЗначениеОбластиДействия = Неопределено;
	УстановитьТипОбласти(ТекСтрока.ВидОбластиДействия);
КонецПроцедуры

&НаКлиенте
Процедура ОбластиДействияЗначениеОбластиДействияПриИзменении(Элемент)
	ЗаполнитьПредставлениеТС();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// УправлениеПредприятием.СлужебныеПодсистемы
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
КонецПроцедуры
// Конец УправлениеПредприятием.СлужебныеПодсистемы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПредставлениеТС()
	Для Каждого ТекСтрока Из Объект.ОбластиДействия Цикл
		Если ТекСтрока.ТипОбласти = "ТС" Тогда
			ПредставлениеТС_ = уатОбщегоНазначения.уатПредставлениеТС(ТекСтрока.ОбластьДействия, ОснОрганизацияПользователя);
		Иначе
			ПредставлениеТС_ = "";
		КонецЕсли;
		Если ТекСтрока.ПредставлениеТС <> ПредставлениеТС_ Тогда
			ТекСтрока.ПредставлениеТС = ПредставлениеТС_;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПараметрВыработкиПрименимДляПострочногоРасчета()
	мсвПараметровВыработки = Новый Массив;
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ВесГруза);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.Объем);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ВремяВРаботе);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.КоличествоЕздок);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.КоличествоОпераций);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.КоличествоПассажиров);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПогрузочноРазгрузочныеРаботы);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.Подача);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСГрузом);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегПорожний);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСпециальнойРаботы);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСпециальнойРаботы2);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСпециальнойРаботы3);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСпециальнойРаботы4);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПробегСпециальнойРаботы5);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПростойПодПогрузкой);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ПростойПодРазгрузкой);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ТнКм);
	мсвПараметровВыработки.Добавить(Справочники.уатПараметрыВыработки.ОбъемКм);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	уатПараметрыВыработки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатПараметрыВыработки КАК уатПараметрыВыработки
	|ГДЕ
	|	НЕ уатПараметрыВыработки.ПометкаУдаления
	|	И НЕ уатПараметрыВыработки.Предопределенный
	|	И уатПараметрыВыработки.СпособРасчетаПараметровВыработки = &СпособРасчетаПараметровВыработки");
	Запрос.УстановитьПараметр("СпособРасчетаПараметровВыработки", Перечисления.уатСпособРасчетаПараметровВыработки.ПоЗаданию);
	мсвДопПараметры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Для Каждого ТекДопПараметр Из мсвДопПараметры Цикл
		мсвПараметровВыработки.Добавить(ТекДопПараметр);
	КонецЦикла;
	
	Возврат мсвПараметровВыработки.Найти(Объект.ПараметрВыработки) <> Неопределено;
КонецФункции

&НаКлиенте
Процедура УстановитьВидимость()
	ЭтоСдельныйЗаработок = ЗначениеЗаполнено(Объект.ВидНачисления) И (Объект.СпособРасчетаОплатыТруда = 
		ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.СдельныйЗаработок"));
	
	Если Объект.СпособРасчетаОплатыТруда = ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы")
		ИЛИ Объект.СпособРасчетаОплатыТруда = ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ПроцентомОтВидовНачислений")
		ИЛИ Объект.СпособРасчетаОплатыТруда = ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки") Тогда
		Элементы.Тариф.Заголовок = "Тариф, %";
	Иначе
		Элементы.Тариф.Заголовок = "Тариф";
	КонецЕсли;
	
	Если Не Объект.СложныйТариф Тогда
		Элементы.ГруппаТаблицаРасчета.Видимость = Ложь;
		Если Объект.ТаблицаРасчета.Количество() > 0 Тогда
			Объект.ТаблицаРасчета.Очистить();
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ГруппировкаТарифа1) Тогда
			Объект.ГруппировкаТарифа1 = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ГруппировкаТарифа2) Тогда
			Объект.ГруппировкаТарифа2 = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ГруппировкаТарифа3) Тогда
			Объект.ГруппировкаТарифа3 = Неопределено;
		КонецЕсли;
		
		Элементы.Тариф.Видимость = Истина;
	Иначе	
		Элементы.ГруппаТаблицаРасчета.Видимость = Истина;
		Элементы.Тариф.Видимость = Ложь;
		Если Объект.Тариф <> 0 Тогда
			Объект.Тариф = 0;
		КонецЕсли;
		
		Элементы.ТаблицаРасчетаЗнакГруппировки1.Видимость	  = ЗначениеЗаполнено(Объект.ГруппировкаТарифа1);
		Элементы.ТаблицаРасчетаЗначениеГруппировки1.Видимость = Элементы.ТаблицаРасчетаЗнакГруппировки1.Видимость;
		Элементы.ТаблицаРасчетаЗначениеГруппировки1.Заголовок = Объект.ГруппировкаТарифа1;
		Элементы.ТаблицаРасчетаЗнакГруппировки2.Видимость	  = ЗначениеЗаполнено(Объект.ГруппировкаТарифа2);
		Элементы.ТаблицаРасчетаЗначениеГруппировки2.Видимость = Элементы.ТаблицаРасчетаЗнакГруппировки2.Видимость;
		Элементы.ТаблицаРасчетаЗначениеГруппировки2.Заголовок = Объект.ГруппировкаТарифа2;		
		Элементы.ТаблицаРасчетаЗнакГруппировки3.Видимость	  = ЗначениеЗаполнено(Объект.ГруппировкаТарифа3);
		Элементы.ТаблицаРасчетаЗначениеГруппировки3.Видимость = Элементы.ТаблицаРасчетаЗнакГруппировки3.Видимость;
		Элементы.ТаблицаРасчетаЗначениеГруппировки3.Заголовок = Объект.ГруппировкаТарифа3;		
		Если НЕ ЗначениеЗаполнено(Объект.ВидНачисления) Тогда
			Элементы.ТаблицаРасчетаТариф.Видимость = Ложь;
		Иначе	
			Элементы.ТаблицаРасчетаТариф.Видимость = Истина;
		КонецЕсли;
		
		Если Элементы.ТаблицаРасчетаЗначениеГруппировки1.Видимость Тогда
			Если Объект.ГруппировкаТарифа1 = ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.КлассГруза") Тогда
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.Формат = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.ФорматРедактирования = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.МинимальноеЗначение = 0;
			Иначе
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.Формат = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.ФорматРедактирования = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки1.МинимальноеЗначение = Неопределено;
			КонецЕсли;
		КонецЕсли;
		Если Элементы.ТаблицаРасчетаЗначениеГруппировки2.Видимость Тогда
			Если Объект.ГруппировкаТарифа2 = ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.КлассГруза") Тогда
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.Формат = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.ФорматРедактирования = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.МинимальноеЗначение = 0;
			Иначе
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.Формат = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.ФорматРедактирования = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки2.МинимальноеЗначение = Неопределено;
			КонецЕсли;
		КонецЕсли;
		Если Элементы.ТаблицаРасчетаЗначениеГруппировки3.Видимость Тогда
			Если Объект.ГруппировкаТарифа3 = ПредопределенноеЗначение("Перечисление.уатГруппировкиТарифов.КлассГруза") Тогда
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.Формат = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.ФорматРедактирования = "ЧДЦ = 1; ЧЦ = 2";
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.МинимальноеЗначение = 0;
			Иначе
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.Формат = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.ФорматРедактирования = "ЧДЦ = 3; ЧЦ = 10";
				Элементы.ТаблицаРасчетаЗначениеГруппировки3.МинимальноеЗначение = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.СложныйТариф.Видимость		 = ЭтоСдельныйЗаработок;
	Элементы.ПараметрВыработки.Видимость = ЭтоСдельныйЗаработок;
	Элементы.РасчетПоСтрокам.Видимость	 = ЭтоСдельныйЗаработок И ПараметрВыработкиПрименимДляПострочногоРасчета();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипОбласти(ТипОбласти)
	Если НЕ ЗначениеЗаполнено(ТипОбласти) Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("Неопределено");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Тягач") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТранспортныеСредства");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.МодельТягача") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатМоделиТС");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ТипТягача") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТипыТранспортныхСредств");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Контрагент") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Подразделение") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ОбъектСтроительства") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.СМ_ОбъектыСтроительства");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ВидПеревозки") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатВидыПеревозок");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Маршрут") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатМаршруты");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ПунктОтправления") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ПунктНазначения") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатПунктыНазначения");
	ИначеЕсли ТипОбласти = ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Номенклатура") Тогда
		ТекОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	КонецЕсли;
	
	Элементы.ОбластиДействияЗначениеОбластиДействия.ОграничениеТипа = ТекОграничениеТипа;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокТиповОбласти()
	Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Очистить();
	Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Тягач"), "ТС");
	Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.МодельТягача"), "Модель ТС");
	Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ТипТягача"), "Тип ТС");
	
	Если Объект.СпособРасчетаОплатыТруда = ПредопределенноеЗначение("Перечисление.уатСпособыРасчетаОплатыТруда.ПроцентомОтВыручки") Тогда
		Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Маршрут"));
		Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Контрагент"));
		
	ИначеЕсли Объект.РасчетПоСтрокам Тогда
		Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Контрагент"));
		Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Подразделение"));
		Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ОбъектСтроительства"));
		Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ВидПеревозки"));
		Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Маршрут"));
		Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ПунктОтправления"));
		Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.ПунктНазначения"));
		Элементы.ОбластиДействияВидОбластиДействия.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыОбластейДействияТарифовТС.Номенклатура"));
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
